<!-- dflook/terraform-github-actions {"workspace":"import-warnings-2","backend_type":"remote","backend":"c539530080d84184c517801085e6694076ffe1fbfc1ae84286bbe4dc7e9f0a36","plan_job_ref":"Job Test Terraform cloud #358 at https://github.com/dflook/terraform-github-actions/actions/runs/16830246757","plan_hash":"ce41ad1138b1c4723b4a87ecef1ee42fdf0543513a84e6e654c4ba1409fc6d07","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __import-warnings-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #358](https://github.com/dflook/terraform-github-actions/actions/runs/16830246757)
<details open><summary>Outputs</summary>

```hcl
default        = "default"
from_tfvars    = "from_tfvars"
from_variables = "from_variables"
```
</details>